1c/configuration/InformationRegisters/ЛК_ОчередьОбменаСЛКСсылочнымиДанными.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>ЛК_ОчередьОбменаСЛКСсылочнымиДанными</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛК_СтатусОбменаСЛК</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЛК_ВидыСобытийСОбъектамиЛК</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1c/configuration/Enums/ЛК_СтатусОбменаСЛК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ЛК_СтатусОбменаСЛК</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1c/configuration/InformationRegisters/ЛК_ОчередьОбменаСЛКСсылочнымиДанными/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Процедура ЗарегистрироватьДобавлениеОбъекта(ОбъектСсылка) Экспорт 
	
	МенеджерЗаписи = РегистрыСведений.ЛК_ОчередьОбменаСЛКСсылочнымиДанными.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект = ОбъектСсылка;
	МенеджерЗаписи.ВидСобытия = Перечисления.ЛК_ВидыСобытийСОбъектамиЛК.Добавление;
	МенеджерЗаписи.Статус = Перечисления.ЛК_СтатусОбменаСЛК.Новый;
	МенеджерЗаписи.ДатаСобытия = ТекущаяДата();
	МенеджерЗаписи.Записать();
		
КонецПроцедуры

Процедура ЗарегистрироватьИзменениеОбъекта(ОбъектСсылка) Экспорт 
	
	МенеджерЗаписи = РегистрыСведений.ЛК_ОчередьОбменаСЛКСсылочнымиДанными.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект = ОбъектСсылка;
	МенеджерЗаписи.ВидСобытия = Перечисления.ЛК_ВидыСобытийСОбъектамиЛК.Изменение;
	МенеджерЗаписи.Статус = Перечисления.ЛК_СтатусОбменаСЛК.Новый;
	МенеджерЗаписи.ДатаСобытия = ТекущаяДата();
	МенеджерЗаписи.Записать();
		
КонецПроцедуры

Процедура ЗарегистрироватьОшибкуОбработки(ОбъектСсылка, ВидСобытия) Экспорт 
	
	МенеджерЗаписи = РегистрыСведений.ЛК_ОчередьОбменаСЛКСсылочнымиДанными.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект = ОбъектСсылка;
	МенеджерЗаписи.ВидСобытия = Перечисления.ЛК_ВидыСобытийСОбъектамиЛК.Изменение;
	МенеджерЗаписи.Статус = Перечисления.ЛК_СтатусОбменаСЛК.Ошибка;
	МенеджерЗаписи.ДатаСобытия = ТекущаяДата();
	МенеджерЗаписи.Записать();
		
КонецПроцедуры

Процедура ЗарегистрироватьУспехОбработки(ОбъектСсылка, ВидСобытия) Экспорт 
	
	МенеджерЗаписи = РегистрыСведений.ЛК_ОчередьОбменаСЛКСсылочнымиДанными.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект = ОбъектСсылка;
	МенеджерЗаписи.ВидСобытия = Перечисления.ЛК_ВидыСобытийСОбъектамиЛК.Изменение;
	МенеджерЗаписи.Статус = Перечисления.ЛК_СтатусОбменаСЛК.Выполнен;
	МенеджерЗаписи.ДатаСобытия = ТекущаяДата();
	МенеджерЗаписи.Записать();
		
КонецПроцедуры

#КонецОбласти
